app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM `comments`

  def new
    @comment = Comment.new
    if !request.xhr?
      @comments = Comment.all
---
SELECT * FROM `comments`

  def create
    @comment = Comment.create(params[:comment])
---
INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `score`) VALUES('2009-05-18 08:14:18', 'my new comment\n', '2009-05-18 08:14:18', 0)

  def update
    @comment = Comment.find(params[:id])
    @comment.score = @comment.score + 1
    @comment.save
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
UPDATE `comments` SET `updated_at` = '2009-05-18 08:14:23', `score` = 1 WHERE `id` = 1

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
DELETE FROM `comments` WHERE `id` = 1